src/Reports/ОтчётПоОценкеЗапасовМПЗ/ОтчётПоОценкеЗапасовМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоОценкеЗапасовМПЗ</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/ОтчётПоОценкеЗапасовМПЗ/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьЛинейкуПоГруппе()
Выборка = Справочники.Линейки.Выбрать(Линейка);
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ЭтоГруппа Тогда
		Возврат(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблГруппаОбщие = Макет.ПолучитьОбласть("Группа|Общие");
ОблГруппаПериод = Макет.ПолучитьОбласть("Группа|Период");
ОблГруппаИтого = Макет.ПолучитьОбласть("Группа|Итого");
ОблМПЗОбщие = Макет.ПолучитьОбласть("МПЗ|Общие");
ОблМПЗПериод = Макет.ПолучитьОбласть("МПЗ|Период");
ОблМПЗИтого = Макет.ПолучитьОбласть("МПЗ|Итого");
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");
ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого");

Запрос = Новый Запрос;
СписокПериодов = Новый СписокЗначений;
СписокМестХранения = Новый СписокЗначений;
ТаблицаМПЗ = Новый ТаблицаЗначений;

ВыбЛинейка = ПолучитьЛинейкуПоГруппе();
СписокМестХранения.Добавить(ВыбЛинейка.МестоХраненияКанбанов);
СписокМестХранения.Добавить(ВыбЛинейка.Подразделение.МестоХраненияПоУмолчанию);

ТаблицаМПЗ.Колонки.Добавить("ГруппаМПЗ",Новый ОписаниеТипов("СправочникСсылка.Материалы"));
ТаблицаМПЗ.Колонки.Добавить("МПЗ",Новый ОписаниеТипов("СправочникСсылка.Материалы"));
ТаблицаМПЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7,0)));
ТаблицаМПЗ.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата"));

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачиВПроизводствоОбороты.МПЗ КАК МПЗ,
	|	ПередачиВПроизводствоОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ПередачиВПроизводствоОбороты.ПериодМесяц КАК Период
	|ИЗ
	|	РегистрНакопления.ПередачиВПроизводство.Обороты(&ДатаНач, &ДатаКон, Авто, ) КАК ПередачиВПроизводствоОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.МестаХранения.Остатки(, МестоХранения В (&СписокМестХранения)) КАК МестаХраненияОстатки
	|		ПО ПередачиВПроизводствоОбороты.МПЗ = МестаХраненияОстатки.МПЗ
	|ГДЕ
	|	ПередачиВПроизводствоОбороты.Документ.Линейка В ИЕРАРХИИ(&СписокЛинеек)";		
	Если ГруппыМПЗ.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ПередачиВПроизводствоОбороты.МПЗ В ИЕРАРХИИ(&ГруппыМПЗ)";
	Запрос.УстановитьПараметр("ГруппыМПЗ", ГруппыМПЗ);
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	Период
								|ИТОГИ
								|	СУММА(КоличествоПриход)
								|ПО
								|	МПЗ,
								|	Период ПЕРИОДАМИ(МЕСЯЦ, , )"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек", Линейка);
Запрос.УстановитьПараметр("СписокМестХранения", СписокМестХранения);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМПЗ.Следующий() Цикл
		Если ТипЗнч(ВыборкаМПЗ.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		Продолжить;
		КонецЕсли; 
	ВыборкаПериод = ВыборкаМПЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период","ВСЕ");
		Пока ВыборкаПериод.Следующий() Цикл
			Если СписокПериодов.НайтиПоЗначению(ВыборкаПериод.Период) = Неопределено Тогда
			СписокПериодов.Добавить(ВыборкаПериод.Период);
			КонецЕсли;
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.ГруппаМПЗ = ПолучитьВерхнегоРодителя(ВыборкаМПЗ.МПЗ);
		ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;
		ТЧ.Количество = ВыборкаПериод.КоличествоПриход;
		ТЧ.Дата = ВыборкаПериод.Период;
		КонецЦикла; 
	КонецЦикла;
ТаблицаМПЗ.Сортировать("ГруппаМПЗ,МПЗ,Дата");
СписокПериодов.СортироватьПоЗначению();
ОблШапкаОбщие.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщие.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого Стр Из СписокПериодов Цикл
	ОблШапкаПериод.Параметры.Период = Формат(Стр.Значение,"ДФ=MM.yy");
	ТабДок.Присоединить(ОблШапкаПериод);
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);
КолИтого = 0;
ТекГруппаМПЗ = Неопределено;
ТекМПЗ = Неопределено;
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
		Если ТЧ.ГруппаМПЗ <> ТекГруппаМПЗ Тогда
			Если ТекГруппаМПЗ <> Неопределено Тогда
			ОблМПЗИтого.Параметры.КоличествоРасходИтого = КолИтого;
			ОблМПЗИтого.Параметры.НеснижаемыйЗапас = ТекМПЗ.МинОстаток;
			ТабДок.Присоединить(ОблМПЗИтого);
			ТабДок.ЗакончитьГруппуСтрок();
			КонецЕсли;
        ОблГруппаОбщие.Параметры.ГруппаМПЗ = ТЧ.ГруппаМПЗ;
		ТабДок.Вывести(ОблГруппаОбщие);
			Для каждого Стр Из СписокПериодов Цикл
			ТабДок.Присоединить(ОблГруппаПериод);
			КонецЦикла;
		ТабДок.Присоединить(ОблГруппаИтого);
		ТабДок.НачатьГруппуСтрок("ГруппыМПЗ",Истина);
		ТекГруппаМПЗ = ТЧ.ГруппаМПЗ;
		ОблМПЗОбщие.Параметры.Статус = ПолучитьСтатус(ТЧ.МПЗ);
		ОблМПЗОбщие.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование); 
		ОблМПЗОбщие.Параметры.МПЗ = ТЧ.МПЗ;
		ОблМПЗОбщие.Параметры.КоличествоСкладЛинейки = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(СписокМестХранения[0].Значение,ТЧ.МПЗ);
		ОблМПЗОбщие.Параметры.КоличествоОсновнойСклад = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(СписокМестХранения[1].Значение,ТЧ.МПЗ); 
		ТабДок.Вывести(ОблМПЗОбщие);	
		КолИтого = 0;
		ТекМПЗ = ТЧ.МПЗ;
		Иначе
			Если ТЧ.МПЗ <> ТекМПЗ Тогда
				Если ТекМПЗ <> Неопределено Тогда
				ОблМПЗИтого.Параметры.КоличествоРасходИтого = КолИтого;
				ОблМПЗИтого.Параметры.НеснижаемыйЗапас = ТекМПЗ.МинОстаток;
				ТабДок.Присоединить(ОблМПЗИтого);				
				КонецЕсли; 
			ОблМПЗОбщие.Параметры.Статус = ПолучитьСтатус(ТЧ.МПЗ);
			ОблМПЗОбщие.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование); 
			ОблМПЗОбщие.Параметры.МПЗ = ТЧ.МПЗ;
			ОблМПЗОбщие.Параметры.КоличествоСкладЛинейки = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(СписокМестХранения[0].Значение,ТЧ.МПЗ);
			ОблМПЗОбщие.Параметры.КоличествоОсновнойСклад = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(СписокМестХранения[1].Значение,ТЧ.МПЗ); 
			ТабДок.Вывести(ОблМПЗОбщие);	
			КолИтого = 0;
			ТекМПЗ = ТЧ.МПЗ;		
			КонецЕсли;
	    КонецЕсли; 
	ОблМПЗПериод.Параметры.КоличествоРасход = ТЧ.Количество;
	КолИтого = КолИтого + ТЧ.Количество;
	ТабДок.Присоединить(ОблМПЗПериод);
	КонецЦикла; 
		Если ТекГруппаМПЗ <> Неопределено Тогда
		ОблМПЗИтого.Параметры.КоличествоРасходИтого = КолИтого;
		ОблМПЗИтого.Параметры.НеснижаемыйЗапас = ТекМПЗ.МинОстаток;
		ТабДок.Присоединить(ОблМПЗИтого);
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЕсли; 
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого Стр Из СписокПериодов Цикл
	Выбор = ТаблицаМПЗ.НайтиСтроки(Новый Структура("Дата",Стр.Значение));
	КолВсего = 0;
		Для к = 0 По Выбор.Количество()-1 Цикл
		КолВсего = КолВсего + Выбор[к].Количество;
		КонецЦикла; 
	ОблКонецПериод.Параметры.КоличествоРасходПериод = КолВсего;
	ТабДок.Присоединить(ОблКонецПериод);
	КонецЦикла;
ОблКонецИтого.Параметры.КоличествоРасходВсего = ТаблицаМПЗ.Итог("Количество");
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 2;
ТабДок.ФиксацияСлева = 4;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры
